stas2z/SoftSerial_STM32/SoftSerial.cpp
#define T_RFR(a) SET_BIT(timerSerialDEV->EGR, 0U)

#define _gpiowrite(a, b, c) (a)->BSRR = (1U << (b)) << (16 * !(c))
#define _gpioread(a, b) ((a)->IDR & (1U << (b)))
#define _readrx(a) _gpioread(rxport, rxbit)
#define _writepin(a, b)                                                        \
  _gpiowrite(get_GPIO_Port(STM_PORT(digitalPin[((a))])),                       \
             STM_PIN(digitalPin[((a))]), ((b)))
#define _writetx(c) _gpiowrite(txport, txbit, ((c)))
#endif

#define BIT_CHECK(a, b) ((a) & (1 << (b)))
/******************************************************************************
 * Timer Definitions
 * Change these if you wish to use different timer channels
 ******************************************************************************/

#define TIMER_MAX_COUNT 0xffff
#define _TX_CHANNEL 3
#define _RX_CHANNEL 4

/******************************************************************************
 * ISR Related to Statics
 * Don't modify anything here unless you know why and what
 ******************************************************************************/
SoftSerial *SoftSerial::interruptObject1;
SoftSerial *SoftSerial::interruptObject2;
SoftSerial *SoftSerial::interruptObject3;
SoftSerial *SoftSerial::interruptObject4;

voidFuncPtr SoftSerial::handleRXEdgeInterruptP[4] = {
    handleRXEdgeInterrupt1, handleRXEdgeInterrupt2, handleRXEdgeInterrupt3,
    handleRXEdgeInterrupt4};

htFuncPtr SoftSerial::handleRXBitInterruptP[4] = {
    handleRXBitInterrupt1, handleRXBitInterrupt2, handleRXBitInterrupt3,
    handleRXBitInterrupt4};

htFuncPtr SoftSerial::handleTXBitInterruptP[4] = {
    handleTXBitInterrupt1, handleTXBitInterrupt2, handleTXBitInterrupt3,
    handleTXBitInterrupt4};

#ifdef BHAL
#define TIMER_CH1 1 // TIM_CHANNEL_1
#define TIMER_CH2 2 // TIM_CHANNEL_2
#define TIMER_CH3 3 // TIM_CHANNEL_3
#define TIMER_CH4 4 // TIM_CHANNEL_4

#define TIMER_DIER_CC1IE_BIT TIM_DIER_CC1IE
#define TIMER_DIER_CC2IE_BIT TIM_DIER_CC2IE
#define TIMER_DIER_CC3IE_BIT TIM_DIER_CC3IE
#define TIMER_DIER_CC4IE_BIT TIM_DIER_CC4IE

#define TIMER_SR_CC1IF_BIT TIM_SR_CC1IF
#define TIMER_SR_CC2IF_BIT TIM_SR_CC2IF
#define TIMER_SR_CC3IF_BIT TIM_SR_CC3IF
#define TIMER_SR_CC4IF_BIT TIM_SR_CC4IF
#endif

#ifdef BMAP
static __always_inline uint32_t __RBIT(uint32_t value) {
  uint32_t result;
  asm volatile("rbit %0, %1" : "=r"(result) : "r"(value));
  return result;
}

#define POSITION_VAL(a) __builtin_clz(__RBIT((a)))
#endif

#if 0
static
  __always_inline
  uint8_t
get_pin_id (uint16_t pin)
{
  uint8_t
    id = 0;

  while (pin != 0x0001)
    {
      pin = pin >> 1;
      id++;
    }

  return id;
}
#else
#define get_pin_id POSITION_VAL
#endif

void SoftSerial::print_counters(HardwareSerial *S) {
  S->println("[" + String(millis()) + "] rxbit=" + String(rxbitc) +
             ", rxedge=" + String(rxedgec) + ", txbit=" + String(txbitc));
}

#if defined(SERIAL_USB) || defined(USBD_USE_CDC)
void SoftSerial::print_counters(USBSerial *S) {
  S->println("[" + String(millis()) + "] rxbit=" + String(rxbitc) +
             ", rxedge=" + String(rxedgec) + ", txbit=" + String(txbitc));
}
#endif

__always_inline void SoftSerial::init_timer_values(uint8_t TX_CHANNEL,
                                                   uint8_t RX_CHANNEL) {
  // reset counters
  rxbitc = rxedgec = txbitc = 0;

  // Assign pointer to the hardware registers
#ifdef BHAL
  timerSerialDEV = TIMS(rxtxTimer);
#else
  timerSerialDEV = timerSerial.c_dev();
#endif

  _rx_channel = RX_CHANNEL;
  _tx_channel = TX_CHANNEL;
  if (_rx_channel == _tx_channel) {
    _rx_channel = _RX_CHANNEL;
    _tx_channel = _TX_CHANNEL;
  }
  switch (_rx_channel) {
  case 1:
    RX_TIMER_CHANNEL = TIMER_CH1;
    RX_TIMER_MASK = TIMER_DIER_CC1IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC1IF_BIT;
    break;
  case 2:
    RX_TIMER_CHANNEL = TIMER_CH2;
    RX_TIMER_MASK = TIMER_DIER_CC2IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC2IF_BIT;
    break;
  case 3:
    RX_TIMER_CHANNEL = TIMER_CH3;
    RX_TIMER_MASK = TIMER_DIER_CC3IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC3IF_BIT;
    break;
  case 4:
  default:
    RX_TIMER_CHANNEL = TIMER_CH4;
    RX_TIMER_MASK = TIMER_DIER_CC4IE_BIT;
    RX_TIMER_PENDING = TIMER_SR_CC4IF_BIT;
    break;
  }
  switch (_tx_channel) {
  case 1:
    TX_TIMER_CHANNEL = TIMER_CH1;
    TX_TIMER_MASK = TIMER_DIER_CC1IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC1IF_BIT;
    break;
  case 2:
    TX_TIMER_CHANNEL = TIMER_CH2;
    TX_TIMER_MASK = TIMER_DIER_CC2IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC2IF_BIT;
    break;
  default:
  case 3:
    TX_TIMER_CHANNEL = TIMER_CH3;
    TX_TIMER_MASK = TIMER_DIER_CC3IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC3IF_BIT;
    break;
  case 4:
    TX_TIMER_CHANNEL = TIMER_CH4;
    TX_TIMER_MASK = TIMER_DIER_CC4IE_BIT;
    TX_TIMER_PENDING = TIMER_SR_CC4IF_BIT;
    break;
  }

  // Translate transmit pin number to external interrupt number
#ifdef BMAP
  txport = PIN_MAP[transmitPin].gpio_device;
  txbit = PIN_MAP[transmitPin].gpio_bit;
  rxport = PIN_MAP[receivePin].gpio_device;
  rxbit = PIN_MAP[receivePin].gpio_bit;
  gpioBit = (exti_num)(txbit);
#else
  txport = get_GPIO_Port(STM_PORT(digitalPin[transmitPin]));
  txbit = STM_PIN(digitalPin[transmitPin]);
  rxport = get_GPIO_Port(STM_PORT(digitalPin[receivePin]));
  rxbit = STM_PIN(digitalPin[receivePin]);
  gpioBit = get_pin_id(STM_GPIO_PIN(digitalPinToPinName(transmitPin)));
#endif
}

/******************************************************************************
 * Convenience functions to disable/enable tx and rx interrupts
 ******************************************************************************/
// Mask transmit interrupt
__always_inline void SoftSerial::noTXInterrupts() {
  // dbg("noTXint");
#ifdef BMAP
  *bb_perip(&(timerSerialDEV->regs).gen->DIER, TX_TIMER_MASK) = 0;
#else
  CLEAR_BIT(timerSerialDEV->DIER, TX_TIMER_MASK);
#endif
}

// Enable transmit interrupt
// Note: Purposely does not clear pending interrupt
__always_inline void SoftSerial::txInterrupts() {
  // dbg("TXint");
#ifdef BMAP
  *bb_perip(&(timerSerialDEV->regs).gen->DIER, TX_TIMER_MASK) = 1;
#else
  SET_BIT(timerSerialDEV->DIER, TX_TIMER_MASK);
#endif
}

// Test if transmit interrupt is enabled
__always_inline uint16_t SoftSerial::isTXInterruptEnabled() {
#ifdef BMAP
  uint16_t val = (*bb_perip(&(timerSerialDEV->regs).gen->DIER, TX_TIMER_MASK));
#else
  uint16_t val =
      (READ_BIT(timerSerialDEV->DIER, TX_TIMER_MASK) == TX_TIMER_MASK);
#endif
  return (val);
}

