stas2z/SoftSerial_STM32/SoftSerial.cpp
// Clear pending interrupt and enable receive interrupt
// Note: Clears pending interrupt
__always_inline void SoftSerial::txInterruptsClr() {
#ifdef BMAP
  *bb_perip(&(timerSerialDEV->regs).gen->SR, TX_TIMER_PENDING) = 0; // Clear
  // int
  // pending
  *bb_perip(&(timerSerialDEV->regs).gen->DIER, TX_TIMER_MASK) = 1;
#else
  CLEAR_BIT(timerSerialDEV->SR, TX_TIMER_PENDING);
  SET_BIT(timerSerialDEV->DIER, TX_TIMER_MASK);
#endif
}

// Mask receive start bit interrupt
__always_inline void SoftSerial::noRXStartInterrupts() {
#ifdef BMAP
  bb_peri_set_bit(&EXTI_BASE->FTSR, gpioBit, 0);
#else
  CLEAR_BIT(EXTI->FTSR, 1U << gpioBit);
#endif
}

// Enable receive start bit interrupt
// Note: Purposely does not clear pending interrupt
__always_inline void SoftSerial::rxStartInterrupts() {
#ifdef BMAP
  bb_peri_set_bit(&EXTI_BASE->FTSR, gpioBit, 1);
#else
  SET_BIT(EXTI->FTSR, 1U << gpioBit);
#endif
}

// Mask receive interrupt
__always_inline void SoftSerial::noRXInterrupts() {
#ifdef BMAP
  *bb_perip(&(timerSerialDEV->regs).gen->DIER, RX_TIMER_MASK) = 0;
#else
  CLEAR_BIT(timerSerialDEV->DIER, RX_TIMER_MASK);
#endif
}

// Enable receive interrupt
// Note: Purposely does not clear pending interrupt
__always_inline void SoftSerial::rxInterrupts() {
#ifdef BMAP
  *bb_perip(&(timerSerialDEV->regs).gen->DIER, RX_TIMER_MASK) = 1;
#else
  SET_BIT(timerSerialDEV->DIER, RX_TIMER_MASK);
#endif
}

// Clear pending interrupt and enable receive interrupt
// Note: Clears pending interrupt
__always_inline void SoftSerial::rxInterruptsClr() {
#ifdef BMAP
  *bb_perip(&(timerSerialDEV->regs).gen->SR, RX_TIMER_PENDING) = 0; // Clear
  // int
  // pending
  *bb_perip(&(timerSerialDEV->regs).gen->DIER, RX_TIMER_MASK) = 1;
#else
  CLEAR_BIT(timerSerialDEV->SR, RX_TIMER_PENDING);
  SET_BIT(timerSerialDEV->DIER, RX_TIMER_MASK);
#endif
}

/******************************************************************************
 * Specialized functions to set interrupt priorities and assign object ointers
 * These are needed due to the gyrations required to support per instance ISRs
 ******************************************************************************/
// Set Interrupt Priority for EXTInt line
void setEXTIntPriority(uint8_t pin, uint8_t priority) {
#ifdef BHAL
  static const IRQn_Type irqnb[16] = {
      EXTI0_IRQn,     // GPIO_PIN_0
      EXTI1_IRQn,     // GPIO_PIN_1
      EXTI2_IRQn,     // GPIO_PIN_2
      EXTI3_IRQn,     // GPIO_PIN_3
      EXTI4_IRQn,     // GPIO_PIN_4
      EXTI9_5_IRQn,   // GPIO_PIN_5
      EXTI9_5_IRQn,   // GPIO_PIN_6
      EXTI9_5_IRQn,   // GPIO_PIN_7
      EXTI9_5_IRQn,   // GPIO_PIN_8
      EXTI9_5_IRQn,   // GPIO_PIN_9
      EXTI15_10_IRQn, // GPIO_PIN_10
      EXTI15_10_IRQn, // GPIO_PIN_11
      EXTI15_10_IRQn, // GPIO_PIN_12
      EXTI15_10_IRQn, // GPIO_PIN_13
      EXTI15_10_IRQn, // GPIO_PIN_14
      EXTI15_10_IRQn, // GPIO_PIN_15
  };
  NVIC_SetPriority(irqnb[get_pin_id(STM_GPIO_PIN(digitalPinToPinName(pin)))],
                   priority);
#else
  switch ((exti_num)(PIN_MAP[pin].gpio_bit)) {
  case EXTI0:
    nvic_irq_set_priority(NVIC_EXTI0, priority);
    break;
  case EXTI1:
    nvic_irq_set_priority(NVIC_EXTI1, priority);
    break;
  case EXTI2:
    nvic_irq_set_priority(NVIC_EXTI2, priority);
    break;
  case EXTI3:
    nvic_irq_set_priority(NVIC_EXTI3, priority);
    break;
  case EXTI4:
    nvic_irq_set_priority(NVIC_EXTI4, priority);
    break;
  case EXTI5:
  case EXTI6:
  case EXTI7:
  case EXTI8:
  case EXTI9:
    nvic_irq_set_priority(NVIC_EXTI_9_5, priority);
    break;
  case EXTI10:
  case EXTI11:
  case EXTI12:
  case EXTI13:
  case EXTI14:
  case EXTI15:
    nvic_irq_set_priority(NVIC_EXTI_15_10, priority);
    break;
  }
#endif
}

// Set Interrupt Priority for Timer Interrupts
// mapple core only, HAL requires hack
void setTimerIntPriority(uint8_t timerNumber, uint8_t priority) {
#ifdef BMAP
  switch (timerNumber) {
  case 1:
    nvic_irq_set_priority(NVIC_TIMER1_UP, priority);
    nvic_irq_set_priority(NVIC_TIMER1_CC, priority);
    break;
  case 2:
    nvic_irq_set_priority(NVIC_TIMER2, priority);
    break;
  case 3:
    nvic_irq_set_priority(NVIC_TIMER3, priority);
    break;
  case 4:
    nvic_irq_set_priority(NVIC_TIMER4, priority);
    break;
  }
#endif
}

// Set the correct interruptObject for this instance
void SoftSerial::setInterruptObject(uint8_t timerNumber) {

  switch (timerNumber) {
  case 1:
    interruptObject1 = this;
    break;
  case 2:
    interruptObject2 = this;
    break;
  case 3:
    interruptObject3 = this;
    break;
  case 4:
    interruptObject4 = this;
    break;
  }
}

/******************************************************************************
 * Constructor / Destructor
 ******************************************************************************/
// Constructor
SoftSerial::SoftSerial(int receivePinT = 15, int transmitPinT = 16,
                       uint8_t rxtxTimerT = 1, uint8_t tx_channel = _TX_CHANNEL,
                       uint8_t rx_channel = _RX_CHANNEL)
    : receivePin(receivePinT), transmitPin(transmitPinT),
      timerSerial(TIMS(rxtxTimerT)), rxtxTimer(rxtxTimerT) {
  init_timer_values(tx_channel, rx_channel);

  // Setup ISR pointer for this instance and timer (one timer per
  // instance)
  // This is a workaround for c++
  setInterruptObject(rxtxTimer);
}

SoftSerial::SoftSerial(int receivePinT = 15, int transmitPinT = 16,
                       uint8_t rxtxTimerT = 1)
    : receivePin(receivePinT), transmitPin(transmitPinT),
      timerSerial(TIMS(rxtxTimerT)), rxtxTimer(rxtxTimerT) {
  init_timer_values(_TX_CHANNEL, _RX_CHANNEL);

  // Setup ISR pointer for this instance and timer (one timer per
  // instance)
  // This is a workaround for c++
  setInterruptObject(rxtxTimer);
}

// Destructor
SoftSerial::~SoftSerial() { end(); }

#ifdef BHAL
#define HTIM HardwareTimer *ht
#define _HTIM ht
//#define _SCOMP ht->setCaptureCompare
//#define _GCOMP ht->getCaptureCompare
#define _SCOMP T_SCOMP
#define _GCOMP T_GCOMP
#else
#define HTIM void
#define _HTIM
#define _SCOMP T_SCOMP
#define _GCOMP T_GCOMP
#endif

