stas2z/SoftSerial_STM32/SoftSerial.cpp
/******************************************************************************
 * TX and RX Interrupt Service Routines
 ******************************************************************************/
// Transmits next bit. Called by timer ch1 compare interrupt
void SoftSerial::txNextBit(HTIM) {
  txbitc++;
  // State 0 through 7 - receive bits
  if (txBitCount <= 7) {
    if (BIT_CHECK(transmitBuffer[transmitBufferRead], txBitCount) > 0)
      _writetx(HIGH);
    else
      _writetx(LOW);

    _SCOMP(TX_TIMER_CHANNEL, ((uint16_t)_GCOMP(TX_TIMER_CHANNEL)) + bitPeriod);

    interrupts();
    // Bump the bit/state counter to state 8
    txBitCount++;

#if DEBUG_DELAY
    _writepin(DEBUG_PIN1, 1);
    _writepin(DEBUG_PIN1, 0);
#endif

    // State 8 - Send the stop bit and reset state to state -1
    // Shutdown timer interrupt if buffer empty
  } else if (txBitCount == 8) {
    // Send the stop bit
    _writetx(HIGH);

    interrupts();

    transmitBufferRead =
        (transmitBufferRead == SS_MAX_TX_BUFF) ? 0 : transmitBufferRead + 1;

    if ((transmitBufferRead != transmitBufferWrite) && activeTX) {

      _SCOMP(TX_TIMER_CHANNEL,
             ((uint16_t)_GCOMP(TX_TIMER_CHANNEL)) + bitPeriod);
      txBitCount = 10;

    } else {

      // Buffer empty so shutdown delay/timer until "write" puts
      // data in
      noTXInterrupts();
    }

    // Send start bit for new byte
  } else if (txBitCount == 10) {
    _writetx(LOW);
    interrupts();

    _SCOMP(TX_TIMER_CHANNEL, ((uint16_t)_GCOMP(TX_TIMER_CHANNEL)) + bitPeriod);

    txBitCount = 0;
  }
}

// Start Bit Receive ISR
__always_inline void SoftSerial::onRXPinChange(void) {
  rxedgec++; // return;
  // Test if this is really the start bit and not a spurious edge
  if ((rxBitCount == 9) && activeRX) {

    // Receive Timer/delay interrupt should be off now - unmask it and
    // center the sampling time
    T_SCOMP(RX_TIMER_CHANNEL, (uint16_t)T_GCNT() + startBitPeriod);
    rxInterruptsClr();

    // Mask pinchange interrupt to reduce needless interrupt
    // overhead while receiving this byte
    noRXStartInterrupts();
    interrupts();

    // Set state/bit to first bit
    rxBitCount = 0;

  } else
    interrupts();
}

// Receive next bit. Called by timer ch2 interrupt
__always_inline void SoftSerial::rxNextBit(HTIM) {
  rxbitc++;
  if (rxBitCount < 8) {

    _SCOMP(RX_TIMER_CHANNEL, ((uint16_t)_GCOMP(RX_TIMER_CHANNEL)) + bitPeriod);

    receiveBuffer[receiveBufferWrite] >>= 1;
    if (_readrx())
      receiveBuffer[receiveBufferWrite] |= 0x80;

#if DEBUG_DELAY
    _writepin(DEBUG_PIN, 1);
    _writepin(DEBUG_PIN, 0);
#endif

    interrupts();

    rxBitCount++;

    // State 8 - Save incoming byte and update buffer
  } else if (rxBitCount == 8) {

    // Finish out stop bit while we...
    // Calculate location in buffer for next incoming byte
    // Test if buffer full
    // If the buffer isn't full update the tail pointer to point to
    // next location
    // Else if it is now full set the buffer overflow flag
    // FYI - With this logic we effectively only have an
    // (SS_MAX_RX_BUFF - 1) buffer size

    interrupts();
    uint8_t next = (receiveBufferWrite + 1) % SS_MAX_RX_BUFF;
    if (next != receiveBufferRead)
      receiveBufferWrite = next;
    else {
      bufferOverflow = true;

#if DEBUG_DELAY
      overFlowTail = receiveBufferWrite;
      overFlowHead = receiveBufferRead;

      _writepin(DEBUG_PIN1, 1);
      _writepin(DEBUG_PIN1, 0);
#endif
    }

    // Re-enable start bit detection
    rxStartInterrupts();

    // Shutdown nextbit timer interrupt until next start bit detected
    noRXInterrupts();

    // Set for state 9 to receive next byte
    rxBitCount = 9;

  } else {
    interrupts();
  }
}

/******************************************************************************
 * Begin - Instance setup
 ******************************************************************************/
void SoftSerial::begin(uint32_t tBaud) {

  _writetx(HIGH);
  pinMode(receivePin, INPUT_PULLUP);
  pinMode(transmitPin, OUTPUT);

#if DEBUG_DELAY
  pinMode(DEBUG_PIN, OUTPUT);
  _writepin(DEBUG_PIN, 0);
  pinMode(DEBUG_PIN1, OUTPUT);
  _writepin(DEBUG_PIN1, 0);
#endif

  // Initialize the timer
  noInterrupts();
  T_PAUSE();

  if (tBaud > 36800) {
    bitPeriod = (uint16_t)((uint32_t)(T_TIMFREQ()) / tBaud);
    startBitPeriod = bitPeriod + (bitPeriod / 2) - 260;
    T_SPSCALE(1);
  } else if (tBaud > 2400) {
    bitPeriod = (uint16_t)((uint32_t)(T_TIMFREQ()) / tBaud);
    startBitPeriod = bitPeriod + (bitPeriod / 2) - 300;
    T_SPSCALE(1);
  } else if (tBaud > 300) {
    bitPeriod = (uint16_t)(((uint32_t)(T_TIMFREQ()) / 16) / tBaud);
    startBitPeriod = bitPeriod + (bitPeriod / 2);
    T_SPSCALE(16);
  } else {
    bitPeriod = (uint16_t)(((uint32_t)(T_TIMFREQ()) / 16) / tBaud) / 2;
    bitPeriod -= 600;
    startBitPeriod = bitPeriod + (bitPeriod / 2);
    T_SPSCALE(16);
  }

  T_SETOF(TIMER_MAX_COUNT);

  // Set transmit bit timer
  // Compare value set later
  T_SMODE(TX_TIMER_CHANNEL, TIMER_OUTPUT_COMPARE);

  // State tx machine start state, attach bit interrupt, and mask it
  // until a byte is sent
  transmitBufferRead = transmitBufferWrite = 0;
  txBitCount = 9;
  T_AINT(TX_TIMER_CHANNEL, handleTXBitInterruptP[rxtxTimer - 1]);
  noTXInterrupts();

  // Set receive bit timer
  // Compare value set later
  T_SMODE(RX_TIMER_CHANNEL, TIMER_OUTPUT_COMPARE);

  // Set rx State machine start state, attach the bit interrupt and mask
  // it until start bit is received
  receiveBufferRead = receiveBufferWrite = 0;
  rxBitCount = 9;
  T_AINT(RX_TIMER_CHANNEL, handleRXBitInterruptP[rxtxTimer - 1]);
  noRXInterrupts();

  // Make the timer we are using a high priority interrupt
#ifdef BMAP
  setTimerIntPriority(rxtxTimer, 0);
#endif

  // Load the timer values and start it
  T_RFR();
  T_RESUM();
#ifdef BHAL
  // timer IRQ priority hack
  static const IRQn_Type irqtim[4] = {TIM1_IRQn, TIM2_IRQn, TIM3_IRQn,
                                      TIM4_IRQn};
  NVIC_DisableIRQ(irqtim[rxtxTimer - 1]);
  if (rxtxTimer == 1)
    NVIC_DisableIRQ(TIM1_CC_IRQn);
  NVIC_SetPriority(irqtim[rxtxTimer - 1], 0);
  if (rxtxTimer == 1)
    NVIC_SetPriority(TIM1_CC_IRQn, 0);
  NVIC_EnableIRQ(irqtim[rxtxTimer - 1]);
  if (rxtxTimer == 1)
    NVIC_EnableIRQ(TIM1_CC_IRQn);
#endif

